Revit 2027 API
Space.ActualOtherLoad Property
Get the Actual Other Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ActualOtherLoad { get; }
Public ReadOnly Property ActualOtherLoad As Double
	Get
public:
property double ActualOtherLoad {
	double get ();
}
member ActualOtherLoad : float with get
Property Value
Double
Remarks
This property is used to get the Actual Other Load (Unit: W) of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace